trade_exp/src/Documents/КорректировкаРеализации/КорректировкаРеализации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КорректировкаРеализации</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.ТоварыКОтгрузкеПоНакладным</registerRecords>
  <attributes>
    <name>СтатьяРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВариантОформленияПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СтатьяДоходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПорядокРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидКорректировки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АналитикаДоходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчетОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПричинаДляОрганизацииСпр</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользуетсяДоговор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1177f555-3120-4d9a-92fd-e87145fc587d">
    <name>СторноОрдер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="27682c97-6778-436b-ab6b-83ad6b951407">
    <name>СтатусДокументаВЭДО</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2b28d27e-1833-4f60-b44d-a36a97c113a8">
    <name>ИсключитьИзКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b2744698-9547-44bb-9ccf-8bec8b6871db">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="79d09653-f81a-4fe1-b137-9efb58de7be9">
    <name>QRкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ac878c96-3a3a-4a6d-9448-252c31a137b1">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="413c2622-4295-47a4-ba77-9b969b8f23e7">
    <name>СпособВводаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c9ac9a40-bf03-4ab4-bab6-5281e24fc192">
    <name>ПодразделениеМенеджера</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="32a1b24c-4de0-44cf-bed2-d98088996efa">
    <name>ОтделМенеджера</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>Расхождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ВариантОтражения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ХарактеристикаНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>1000</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЗаказКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НоменклатураНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыЗапасовСписание</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>1000</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НоменклатураНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВариантОтражения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ХарактеристикаНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЗаказКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыЗапасовОприходование</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыЗапасовКорректировкаВыручки</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/ДополнительныеСведения/ДополнительныеСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3ad5d8a7-3071-46aa-aebf-306bdb67983b">
  <name>ДополнительныеСведения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ab7ef662-71c1-4d51-9f0f-ea8c5ea3df8a">
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="cb954476-c551-4a06-9bcd-18d67ba47dc8">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="79201015-bfae-463e-81f1-0ae2d3066f3f">
    <name>Свойство</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/ВидыОперацийКорректировкиНазначения/ВидыОперацийКорректировкиНазначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="55921462-a9cd-42ad-9386-49cd47c6df6e">
  <name>ВидыОперацийКорректировкиНазначения</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="fc4361ed-325b-4460-a530-104db1e98919">
    <name>СнятьРезерв</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f7cbe6fb-d01a-48b8-93e0-cb3be11dcd09">
    <name>СнятьРезервПоМногимНазначениям</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e009e0a2-e2b2-4e55-a296-ab8ffe765b9a">
    <name>Резервировать</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c23a1733-84b5-4df7-bbbd-2e5b0a20dd00">
    <name>РезервироватьИКорректировать</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1ceddb16-0e78-40dc-9848-fd4a0a1ad344">
    <name>ПроизвольнаяКорректировкаНазначений</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="bd497e3c-da4b-4ffc-bcec-93b90a861a8d">
    <name>ВстречнаяКорректировка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/КорректировкаРеализации/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда  

&Перед("ОбработкаПроверкиЗаполнения")
Процедура Док_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив;
	МассивНепроверяемыхРеквизитов.Добавить("Договор");
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
КонецПроцедуры

&Перед("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, ПараметрыЗаписи)	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
		И ЗначениеЗаполнено(ДокументОснование.Кассир) = Ложь Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Запись документа без отметки кассы в документе продажи запрещена.";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&После("ПередЗаписью")
Процедура Док_ПередЗаписью1(Отказ, РежимЗаписи, РежимПроведения)
	Если Не Отказ И ЗначениеЗаполнено(Ссылка) И Не Проведен И ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Попытка
			Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда	
				Если Не ПометкаУдаления Тогда                               // Записанный документ проводится
					НаличиеКорректировки = АльтерраОбщегоНазначения.ПолучитьКорректировкуНазначения(Ссылка, Ложь, Ложь);
				КонецЕсли;
			Иначе
				Если Не Ссылка.ПометкаУдаления И ПометкаУдаления Тогда      // Пометка на удаление записанного документа
					Если Не РольДоступна("ПолныеПрава") Тогда
						АльтерраОбщегоНазначения.ПроверитьНаличиеПриходныхОрдеров(Ссылка, Ложь, Ложь, "Сначала необходимо пометить на удаление следуюшие документы:", Отказ);
			        КонецЕсли;

					Если Не Отказ Тогда
						НаличиеКорректировки = АльтерраОбщегоНазначения.ПолучитьКорректировкуНазначения(Ссылка, Ложь, Ложь);
						Если ЗначениеЗаполнено(НаличиеКорректировки) Тогда
							НаличиеКорректировки.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли Ссылка.ПометкаУдаления И Не ПометкаУдаления Тогда // Пометка на удаление снимается
					НаличиеКорректировки = АльтерраОбщегоНазначения.ПолучитьКорректировкуНазначения(Ссылка, Ложь, Истина);
					Если ЗначениеЗаполнено(НаличиеКорректировки) Тогда
						НаличиеКорректировки.ПолучитьОбъект().УстановитьПометкуУдаления(Ложь);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Исключение
			ВызватьИсключение;
		КонецПопытки;	
	КонецЕсли;
	
КонецПроцедуры


&После("ПриЗаписи")
Процедура Док_ПриЗаписи(Отказ)
	
	Если Не Отказ Тогда
		
		КорректировкаНазначения = АльтерраОбщегоНазначения.ПолучитьКорректировкуНазначения(Ссылка, Проведен, ПометкаУдаления);	
		
		Если ЗначениеЗаполнено(КорректировкаНазначения) И	
			КорректировкаНазначения.Дата < (Дата + 60) Тогда
			Попытка
				КорректировкаНазначения = КорректировкаНазначения.ПолучитьОбъект();      
				КорректировкаНазначения.Дата = Дата + 60;
				УстановитьПривилегированныйРежим(Истина);
				КорректировкаНазначения.Записать(РежимЗаписиДокумента.Проведение);
				УстановитьПривилегированныйРежим(Ложь);
			Исключение
				ВызватьИсключение;
			КонецПопытки;  
		КонецЕсли;
		
 	КонецЕсли;
	
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура Док_ОбработкаПроведения(Отказ, РежимПроведения)
	Если Не ЗначениеЗаполнено(ПричинаДляОрганизацииСпр) Тогда
		Сообщить("Не заполнена Причина корректировки! (Вкладка: Дополнительно)");
		Отказ = Истина;
	КонецЕсли;  
	
	Если Не Отказ Тогда
	    СоздатьКорректировкуНазначения(Дата + 60);	
	КонецЕсли; 
	
	Если ЭтотОбъект.Проведен Тогда
		Документы.ЗаявкаВЕГАИСЛес.ПроверкаЕГАИС(ДокументОснование, ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

Функция ЕстьТоварыКОбособленномуОбеспечению(Назначение,МассивНоменклатуры) 
	
	Если Не ЗначениеЗаполнено(Назначение) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОбеспечениеЗаказов.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.ОбеспечениеЗаказов КАК ОбеспечениеЗаказов
	|ГДЕ
	|	ОбеспечениеЗаказов.Назначение = &Назначение
	|	И ОбеспечениеЗаказов.Номенклатура В(&Номенклатура)";
	
	Запрос.УстановитьПараметр("Назначение", Назначение);
	Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатуры);
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Не Запрос.Выполнить().Пустой();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции

&После("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ВидКорректировки=Перечисления.ХозяйственныеОперации.КорректировкаПоСогласованиюСторон;
	Если ДанныеЗаполнения.Свойство("ДокументОснование") Тогда
		Менеджер = ДанныеЗаполнения.ДокументОснование.Менеджер;
		Магазин = ДанныеЗаполнения.ДокументОснование.Магазин; 
		Если Не БонусыАльтерраРезерв.ПолучитьЗначениеРеквизита(ДанныеЗаполнения.ДокументОснование, "ПодразделениеМенеджера") = Ложь 
				и Не БонусыАльтерраРезерв.ПолучитьЗначениеРеквизита(ДанныеЗаполнения.ДокументОснование, "ОтделМенеджера") = Ложь Тогда
			ПодразделениеМенеджера = ДанныеЗаполнения.ДокументОснование.ПодразделениеМенеджера;
			ОтделМенеджера = ДанныеЗаполнения.ДокументОснование.ОтделМенеджера;
		КонецЕсли;

		Если ТипЗнч(ДанныеЗаполнения.ДокументОснование)= Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ
			ТипЗнч(ДанныеЗаполнения.ДокументОснование)= Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			ИспользуетсяДоговор=ДанныеЗаполнения.ДокументОснование.ИспользуетсяДоговор;
			Если ИспользуетсяДоговор Тогда
				Договор=ДанныеЗаполнения.ДокументОснование.Договор;
			Иначе
				Договор="";
			КонецЕсли;
			СпособВводаКлиента = ДанныеЗаполнения.ДокументОснование.СпособВводаКлиента;
		КонецЕсли;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПодразделениеМенеджера) и Не ЗначениеЗаполнено(ОтделМенеджера)Тогда
		ПодразделениеМенеджера = ПолучитьПодразделениеМенеджера(Менеджер); 
		ОтделМенеджера = ПолучитьОтделМенеджера(Менеджер);
	КонецЕсли; 

КонецПроцедуры

&Перед("ОбработкаУдаленияПроведения")
Процедура Док_ОбработкаУдаленияПроведения(Отказ)
	Если Не Отказ И ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Попытка
			Если Не РольДоступна("ПолныеПрава") Тогда
				Если ПометкаУдаления Тогда     // Пометка на удаление проведенного документа
					АльтерраОбщегоНазначения.ПроверитьНаличиеПриходныхОрдеров(Ссылка, Истина, Ложь, "Сначала необходимо пометить на удаление следуюшие документы:", Отказ);
				Иначе                          // Распроведение документа
					АльтерраОбщегоНазначения.ПроверитьНаличиеПриходныхОрдеров(Ссылка, Истина, Ложь, "Сначала необходимо снять с проведения следуюшие документы:", Отказ);
				КонецЕсли;
			КонецЕсли;
						
			Если Не Отказ Тогда
				НаличиеКорректировки = АльтерраОбщегоНазначения.ПолучитьКорректировкуНазначения(Ссылка, Истина, Ложь);
				Если ЗначениеЗаполнено(НаличиеКорректировки) Тогда
					Если ПометкаУдаления Тогда // Пометка на удаление проведенного документа
						НаличиеКорректировки.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
					Иначе                      // Распроведение документа
						НаличиеКорректировки.ПолучитьОбъект().Записать(РежимЗаписиДокумента.ОтменаПроведения);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Исключение
			ВызватьИсключение;
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура Док_ОбработкаУдаленияПроведения1(Отказ)
	
	АльтерраОбщегоНазначения.КонтрольОтметкиКассы(ЭтотОбъект, Отказ);
	
	РегистрыСведений.СостоянияОтгрузкиНакладных.УдалениеЗаписейВРегистре(ЭтотОбъект); 

КонецПроцедуры

&После("ПриКопировании")
Процедура Док_ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.QRкод = "";
КонецПроцедуры

&После("ПередУдалением")
Процедура Док_ПередУдалением(Отказ)
	ДопМодульСервер.ПроверитьНаличиеРасходногоОрдераНаТовары(Ссылка, Отказ);
КонецПроцедуры

Процедура СоздатьКорректировкуНазначения(ДатаКорректировки = '00010101')
	
 УстановитьПривилегированныйРежим(Истина);
	
	Если Не СкладыСервер.ИспользоватьОрдернуюСхемуПриПоступлении(Склад,Дата) Тогда 
		Заказ = Документы.ЗаказКлиента.ПустаяСсылка();
		
		Заказ = ДокументОснование.ЗаказКлиента;
		
		Если Не Заказ = Неопределено Тогда
			Если Не Заказ.Пустая() Тогда
				Назначение = Документы.КорректировкаНазначенияТоваров.НазначениеЗаказа(Заказ);
				
				Если Документы.КорректировкаНазначенияТоваров.ЕстьТоварыКСнятиюРезерва(Назначение) Тогда
					КорректировкаНазначения = Документы.КорректировкаНазначенияТоваров.СоздатьДокумент();
					
					ОрганизацияЗаказа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заказ, "Организация");
					
					КорректировкаНазначения.Организация = ОрганизацияЗаказа;
					КорректировкаНазначения.Назначение = Назначение;
					КорректировкаНазначения.ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезерв;
					КорректировкаНазначения.Дата = ?(ДатаКорректировки = '00010101', ТекущаяДатаСеанса(),ДатаКорректировки);
					КорректировкаНазначения.УстановитьНовыйНомер();
					КорректировкаНазначения.Автор = Справочники.Пользователи.НайтиПоНаименованию("Администратор"); 
					КорректировкаНазначения.Ответственный = ПараметрыСеанса.ТекущийПользователь;
					КорректировкаНазначения.Комментарий = "Создана автоматически при создании документа "" " + Ссылка + """";
					
					Для Каждого СтрокаТовара Из Расхождения Цикл
						Если СтрокаТовара.Назначение = Назначение Тогда
							СтрокаПродукция = КорректировкаНазначения.Товары.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаПродукция, СтрокаТовара);
						КонецЕсли;
					КонецЦикла;
					
					ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(КорректировкаНазначения, Документы.КорректировкаНазначенияТоваров));
					НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(КорректировкаНазначения, ПараметрыУказанияСерий);
					
					Документы.КорректировкаНазначенияТоваров.ЗаполнитьПоОснованию(Назначение, ОрганизацияЗаказа,КорректировкаНазначения.Ссылка, Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезерв, КорректировкаНазначения.Товары,);
					Для Каждого Строка Из КорректировкаНазначения.Товары Цикл
						Строка.склад = Склад;
					КонецЦикла;
					Если КорректировкаНазначения.Товары.Количество()>0 Тогда
						КорректировкаНазначения.Записать(РежимЗаписиДокумента.Проведение);
					КонецЕсли; 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
  УстановитьПривилегированныйРежим(Ложь);  
КонецПроцедуры

&НаСервере
Функция ПолучитьОтделМенеджера(Менеджер)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДополнительныеСведения.Значение.Наименование КАК Отдел
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО (ДополнительныеСведения.Объект = Пользователи.Ссылка)
		|ГДЕ
		|	Пользователи.Ссылка = &Ссылка
		|	И ДополнительныеСведения.Свойство.Наименование = ""Отделы (Пользователи)""";
	
	Запрос.УстановитьПараметр("Ссылка", Менеджер);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Отдел;
КонецФункции

&НаСервере
Функция ПолучитьПодразделениеМенеджера(Менеджер)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Пользователи.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Менеджер);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Подразделение;
КонецФункции

#КонецЕсли
